<a href="https://colab.research.google.com/github/divi1287/hello-world/blob/main/DEMO_5_ICC_DATA_MANIPULATION.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Import Libraries

In [ ]:
import pandas as pd 
import numpy as np

In [ ]:
# create a pandas series of integers from 1 to 50
my_series = pd.Series(np.arange(1, 51, 1)) #np.range(1,51,1)

## head() - Check the first 5 elements

In [ ]:
my_series.head()

0    1
1    2
2    3
3    4
4    5
dtype: int32

## tail() - check the last 5 elements

In [ ]:
my_series.tail()

45    46
46    47
47    48
48    49
49    50
dtype: int32

## Extract only the values of the series (without the indices)

In [ ]:
my_series.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50])

In [ ]:
# my_series

## groupby()

In [ ]:
# create a dictionary `world_cup` to be used to build a dataframe

world_cup = {'team' : ['West Indies', 'West Indies', 'India', 'Australia', 'Pakistan', 'Sri Lanka', 'Australia', 'Australia', 'Australia' ,'England'],
             'Rank' : [7,7,2,1,6,4,1,1,1,2],
             'Year' : [1975,1979,1983,1987,1992,1996,1999,2003,2007,2011],
             'Points' : [875,756,786,718,726,662,680,711,531,599]}
world_cup = {'Team':['West Indies','West Indies','India','Australia','Pakistan','Sri Lanka','Australia','Australia','Australia','India','Australia'],
             'Rank':[7,7,2,1,6,4,1,1,1,2,1],
             'Year':[1975,1979,1983,1987,1992,1996,1999,2003,2007,2011,2015]}

In [ ]:
# create a dataframe using the above world_cup dictionary elements
df = pd.DataFrame(world_cup)
df

           Team  Rank  Year
0   West Indies     7  1975
1   West Indies     7  1979
2         India     2  1983
3     Australia     1  1987
4      Pakistan     6  1992
5     Sri Lanka     4  1996
6     Australia     1  1999
7     Australia     1  2003
8     Australia     1  2007
9         India     2  2011
10    Australia     1  2015

In [ ]:
# highest ranking achieved by each of the teams
df.groupby('Team')['Rank'].min()

Team
Australia      1
India          2
Pakistan       6
Sri Lanka      4
West Indies    7
Name: Rank, dtype: int64

In [ ]:
df.groupby('Team').size()

Team
Australia      5
India          2
Pakistan       1
Sri Lanka      1
West Indies    2
dtype: int64

In [ ]:
df.groupby('Team').count()

             Rank  Year
Team
Australia       5     5
India           2     2
Pakistan        1     1
Sri Lanka       1     1
West Indies     2     2

In [ ]:
# what is the latest year in which each team won the world cup

df.groupby('Team')['Year'].max() # aggregation function - min,max,mean,median,mode

Team
Australia      2015
India          2011
Pakistan       1992
Sri Lanka      1996
West Indies    1979
Name: Year, dtype: int64

## Concatenation

In [ ]:
# create a dictionary 'world_champions'
world_champions = {'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
                   'ICC_rank':[2,3,7,8,4],
                   'World_champions_Year':[2011,2015,1979,1992,1996],
                   'Points':[874,787,753,673,855]}

In [ ]:
# create a dictionary of chokers
chokers = {'Team':['South Africa','New Zealand','Zimbabwe'],
                   'ICC_rank':[1,5,9],
                   'Points':[895,764,656]}

In [ ]:
# create dataframe of world_champions
df1 = pd.DataFrame(world_champions)

# create dataframe of chokers
df2 = pd.DataFrame(chokers)

In [ ]:
# print the dataframes
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [ ]:
df2

           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

In [ ]:
# concatenate the daraframes
pd.concat([df1,df2],ignore_index=True)

           Team  ICC_rank  World_champions_Year  Points
0         India         2                2011.0     874
1     Australia         3                2015.0     787
2   West Indies         7                1979.0     753
3      Pakistan         8                1992.0     673
4     Sri Lanka         4                1996.0     855
5  South Africa         1                   NaN     895
6   New Zealand         5                   NaN     764
7      Zimbabwe         9                   NaN     656

## Merge

In [ ]:
# create a dictionary of champion_stats
champion_stats = {'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
                   'ICC_rank':[2,3,7,8,4],
                   'World_champions_Year':[2011,2015,1979,1992,1996],
                   'Points':[874,787,753,673,855]}

In [ ]:
# create a dictionary of match stats
match_stats = {'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
                   'World_cup_played':[11,10,11,9,8],
                   'ODIs_played':[733,988,712,679,662]}

In [ ]:
# create dataframe of champion stats
df1 = pd.DataFrame(champion_stats)

# create dataframe of match stats
df2 = pd.DataFrame(match_stats)

In [ ]:
# print the dataframes
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [ ]:
df2

          Team  World_cup_played  ODIs_played
0        India                11          733
1    Australia                10          988
2  West Indies                11          712
3     Pakistan                 9          679
4    Sri Lanka                 8          662

In [ ]:
# merge df1 & df2 on Team column
pd.merge(df1,df2,on='Team')

,Team,ICC_rank,World_champions_Year,Points,World_cup_played,ODIs_played
0,India,2,2011,874,11,733
1,Australia,3,2015,787,10,988
2,West Indies,7,1979,753,11,712
3,Pakistan,8,1992,673,9,679
4,Sri Lanka,4,1996,855,8,662

## Joins - Left Join

In [ ]:
# champions & Chokers
df1 = pd.DataFrame(world_champions)
df2 = pd.DataFrame(chokers)

In [ ]:
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [ ]:
df2

           Team  ICC_rank  Points
0  South Africa         1     895
1   New Zealand         5     764
2      Zimbabwe         9     656

## Right Join

In [ ]:
pd.merge(df1,df2,how='right',on='Team')

,Team,ICC_rank_x,World_champions_Year,Points_x,ICC_rank_y,Points_y
0,South Africa,NaN,NaN,NaN,1,895
1,New Zealand,NaN,NaN,NaN,5,764
2,Zimbabwe,NaN,NaN,NaN,9,656

## Inner Join

In [ ]:
pd.merge(df1,df2,how='inner',on='Team')

Empty DataFrame
Columns: [Team, ICC_rank_x, World_champions_Year, Points_x, ICC_rank_y, Points_y]
Index: []

## Full Outer Join

In [ ]:
pd.merge(df1,df2,how='outer',on='Team')

,Team,ICC_rank_x,World_champions_Year,Points_x,ICC_rank_y,Points_y
0,India,2.0,2011.0,874.0,NaN,NaN
1,Australia,3.0,2015.0,787.0,NaN,NaN
2,West Indies,7.0,1979.0,753.0,NaN,NaN
3,Pakistan,8.0,1992.0,673.0,NaN,NaN
4,Sri Lanka,4.0,1996.0,855.0,NaN,NaN
5,South Africa,NaN,NaN,NaN,1.0,895.0
6,New Zealand,NaN,NaN,NaN,5.0,764.0
7,Zimbabwe,NaN,NaN,NaN,9.0,656.0

## Type Casting
Changing the datatype of a variable from one type to another

In [ ]:
num = 12

In [ ]:
type(num)

int

In [ ]:
fl_num = float(num)

In [ ]:
type(fl_num)

float

In [ ]:
name = 'Data'

In [ ]:
type(name)

str

In [ ]:
num = 23

In [ ]:
str_num = str(num)

In [ ]:
type(str_num)

str

In [ ]:
str_num

'23'

In [ ]:
num = int(str_num)

In [ ]:
type(num)

int

In [ ]:
bool_var = True

In [ ]:
bool_int = int(bool_var)

In [ ]:
bool_int

1

In [ ]:
name = 'ML'

In [ ]:
int_name = int(name)

ValueError: invalid literal for int() with base 10: 'ML'